[
  "[Python] Python is one of the most popular programming languages. It’s simple to use, packed with features and supported by a wide range of libraries and frameworks. Its clean syntax makes it beginner-friendly. ",
  "[Python] The following is a simple program that displays the message “Hello, World!” on the screen.",
  "[Python] To understand working of this code, refer to our article Python Introduction.",
  "[Python] Try our ongoing free course Python Skillup with weekly topic coverage, notes, daily quizzes and coding problems.",
  "[Python] In this section, we’ll cover the basics of Python programming, including installing Python, writing first program, understanding comments and working with variables, keywords and operators. ",
  "[Python] Before starting to learn python we need to install python on our system.",
  "[Python] In this section of Python 3 tutorial we'll explore Python function syntax, parameter handling, return values and variable scope. Along the way, we'll also introduce versatile functions like range(), map, filter and lambda functions. ",
  "[Python] Python offers versatile collections of data types, including lists, string, tuples, sets, dictionaries and arrays. In this section, we will learn about each data types in detail.",
  "[Python] Python's collections module offers essential data structures, including the following:",
  "[Python] To learn data structure and algorithm with python in detail, you can refer to our DSA with Python Tutorial.",
  "[Python] In this section, we'll explore the core principles of object-oriented programming (OOP) in Python. From encapsulation to inheritance, polymorphism, abstract classes and iterators, we'll cover the essential concepts that helps you to build modular, reusable and scalable code. ",
  "[Python] In this section, we'll explore Python Exception Handling that how Python deals with unexpected errors, enabling us to write fault-tolerant code. We'll cover file handling, including reading from and writing to files.",
  "[Python] In this section, we will cover file handling, including reading from and writing to files.",
  "[Python] In this section we will learn how to access and work with MySQL and MongoDB databases",
  "[Python] Python is a huge collection of Python Packages standard libraries that make development easier. These libraries help with a wide range of tasks and can save you a lot of time by providing ready-to-use tools.",
  "[Python] Some commonly used types of libraries in Python include:",
  "[Python] 1. Foundational Libraries: These are the libraries that form the base for all data science work. Start here to build a strong foundation.",
  "[Python] 2. Advanced Visualization and Statistical Tools: Once you’re comfortable with basic data handling and visualization, move to creating cleaner visuals and performing statistical analysis.",
  "[Python] 3. Machine Learning Libraries: After data manipulation and visualization, learn machine learning, starting with simpler models and moving to advanced ones.",
  "[Python] 4. Deep Learning Frameworks: If you’re interested in AI and deep learning, these libraries will allow you to build and train neural networks.",
  "[Python] To learn more, you can refer to Python for Data Science.",
  "[Python] 1. Core Web Frameworks (Backend Development with Python): These are the tools for building Python-based web applications.",
  "[Python] 2. Database Integration: Learn how to connect Python web frameworks to databases for storing and retrieving data.",
  "[Python] 3. Front-End and Backend Integration: Learn how to connect Python backends with front-end technologies to create dynamic, full-stack web applications.",
  "[Python] 4. API Development: Learn to build APIs (Application Programming Interfaces) for connecting your backend with front-end apps or other services.",
  "[Python] To learn more, you can refer to Python for Web Development.",
  "[Python] Python quiz page covers topics including variables, data types, input, output, lists, tuples, dictionaries and sets. The Python Coding Practice Problems page offers exercises on loops, functions, lists, strings, dictionaries, sets and advanced structures like heaps and deques. ",
  "[Python]     This Python tutorial is updated based on latest Python 3.13.1 version.",
  "[Python] K",
  "[Python] K",
  "[Python] Python Introduction",
  "[Python] Input and Output in Python",
  "[Python] Python Variables",
  "[Python] Python Operators",
  "[Python] Python Keywords",
  "[Python] Python Data Types",
  "[Python] Conditional Statements in Python",
  "[Python] Loops in Python - For, While and Nested Loops",
  "[Python] Python Functions",
  "[Python] Recursion in Python",
  "[Python] Python Lambda Functions",
  "[Python] Python String",
  "[Python] Python Lists",
  "[Python] Python Tuples",
  "[Python] Python Dictionary",
  "[Python] Python Sets",
  "[Python] Python Arrays",
  "[Python] List Comprehension in Python",
  "[Python] Python OOP Concepts",
  "[Python] Python Exception Handling",
  "[Python] File Handling in Python",
  "[Python] Python Database Tutorial",
  "[Python] Python MongoDB Tutorial",
  "[Python] Python MySQL",
  "[Python] Python Packages",
  "[Python] Python Modules",
  "[Python] Python DSA Libraries",
  "[Python] List of Python GUI Library and Packages",
  "[Python] NumPy Tutorial - Python Library",
  "[Python] Pandas Tutorial",
  "[Python] Matplotlib Tutorial",
  "[Python] Python Seaborn Tutorial",
  "[Python] StatsModel Library - Tutorial",
  "[Python] Learning Model Building in Scikit-learn",
  "[Python] TensorFlow Tutorial",
  "[Python] PyTorch Tutorial",
  "[Python] Flask Tutorial",
  "[Python] Django Tutorial | Learn Django Framework",
  "[Python] Django ORM - Inserting, Updating & Deleting Data",
  "[Python] Templating With Jinja2 in Flask",
  "[Python] Django Templates",
  "[Python] Build a REST API using Flask - Python",
  "[Python] Building a Simple API with Django REST Framework",
  "[Python] Python Quiz",
  "[Python] Python Coding Practice",
  "[Python] Python Interview Questions and Answers",
  "[Java] Java is a high-level, object-oriented programming language used to build web apps, mobile applications, and enterprise software systems.",
  "[Java] Try our ongoing free courses Java Skillup and Advance Java Skillup with weekly topic coverage, notes, daily quizzes and coding problems.",
  "[Java] The following is a simple program that displays the message “Hello, World!” on the screen.",
  "[Java] To understand working of this code, refer Java Introduction.",
  "[Java] Java basics form the foundation of your programming journey, covering essential concepts like syntax, data types, variables, loops, and conditionals.",
  "[Java] Java methods are reusable blocks of code that perform specific tasks and help organize your program. They improve code readability, reduce repetition, and make debugging easier.",
  "[Java] Java arrays are containers that store multiple values of the same data type in a single variable. They provide an efficient way to manage and access collections of data using index-based positions.",
  "[Java] Java Strings represent sequences of characters and are widely used in text processing. They are immutable, meaning once created, their values cannot be changed.",
  "[Java] Java Regex (Regular Expressions) allows pattern matching and text manipulation using the java.util.regex package. It is powerful for validating, searching, and replacing strings based on specific patterns.",
  "[Java] Java follows the Object-Oriented Programming (OOP) paradigm, which organizes code into classes and objects. Core OOP principles like inheritance, encapsulation, polymorphism, and abstraction make Java modular and scalable.",
  "[Java] Java interfaces define a contract that classes must follow, specifying method signatures without implementations. They enable abstraction and support multiple inheritance in Java through a clean, structured approach.",
  "[Java] Java Exception Handling is a mechanism to handle runtime errors, ensuring the program runs smoothly without crashing. It uses keywords like try, catch, throw, throws, and finally to manage exceptions.",
  "[Java] Java Memory Allocation refers to how memory is assigned to variables, objects, and classes during program execution. It involves stack and heap memory, with the JVM managing allocation and garbage collection automatically.",
  "[Java] Java Collections provide a framework for storing and manipulating groups of objects efficiently. It includes interfaces like List, Set, and Map, along with classes like ArrayList, HashSet, and HashMap.",
  "[Java] Java Streams and Lambda Expressions simplify data processing by enabling functional-style operations on collections. Lambdas provide concise syntax for anonymous functions, while Streams allow efficient filtering, mapping, and reduction of data.",
  "[Java] Java Multithreading allows concurrent execution of two or more threads, enabling efficient CPU utilization and faster program performance. It is commonly used for tasks that required parallel processing and responsiveness from multiple ends.",
  "[Java] Java File Handling enables programs to create, read, write, and manipulate files stored on the system. It uses classes from the java.io and java.nio packages for efficient file operations.",
  "[Java] Java Networking enables communication between devices over a network using classes from the java.net package. It supports protocols like TCP and UDP for building client-server applications and data exchange.",
  "[Java] Prepare for Java interviews with these commonly asked questions, covering core concepts, OOP, collections, multithreading, exception handling, and frameworks like Spring and Hibernate.",
  "[Java] K",
  "[Java] K",
  "[Java] Introduction to Java",
  "[Java] Java Programming Basics",
  "[Java] Java Methods",
  "[Java] Access Modifiers in Java",
  "[Java] Arrays in Java",
  "[Java] Java Strings",
  "[Java] Regular Expressions in Java",
  "[Java] Classes and Objects in Java",
  "[Java] Access Modifiers in Java",
  "[Java] Java Constructors",
  "[Java] Java OOP(Object Oriented Programming) Concepts",
  "[Java] Java Packages",
  "[Java] Java Interface",
  "[Java] Collections in Java",
  "[Java] Collections Class in Java",
  "[Java] Collection Interface in Java",
  "[Java] Iterator in Java",
  "[Java] Java Comparator Interface",
  "[Java] Java Exception Handling",
  "[Java] Java Try Catch Block",
  "[Java] Java final, finally and finalize",
  "[Java] Chained Exceptions in Java",
  "[Java] Null Pointer Exception in Java",
  "[Java] Exception Handling with Method Overriding in Java",
  "[Java] Java Multithreading Tutorial",
  "[Java] Synchronization in Java",
  "[Java] File Handling in Java",
  "[Java] Java Method References",
  "[Java] Java 8 Stream Tutorial",
  "[Java] Java Networking",
  "[Java] JDBC Tutorial",
  "[Java] Java Memory Management",
  "[Java] Garbage Collection in Java",
  "[Java] Memory Leaks in Java",
  "[Java] Java Interview Questions and Answers",
  "[Java] Java Programs - Java Programming Examples",
  "[Java] Java Exercises - Basic to Advanced Java Practice Programs with Solutions",
  "[Java] Java Quiz",
  "[Java] Java Project Ideas For Beginners and Advanced",
  "[C] C is a general-purpose mid-level programming language developed by Dennis M. Ritchie at Bell Laboratories in 1972. It was initially used for the development of UNIX operating system, but it later became popular for a wide range of applications. Today, C remains one of the top three most widely used programming languages.",
  "[C] This section of the C Tutorial includes basic concepts that build the foundation for writing C programs. It teaches you how to store and output data, perform arithmetic and other operations, control the program flow, etc.",
  "[C] Functions are block of code that performs a specific task. They allow programmers to write modular and reusable code.",
  "[C] Compound data types are created from primitive data types and provides a different way to use them according to our needs. This section of C tutorial teaches you about the compound data types and how to efficiently organize and process real world data.",
  "[C] This section covers the manual memory management in C using pointers. The dynamic memory management in C uses functions like malloc(), calloc(), realloc(), and free() to manually manage the memory while avoiding errors such as memory leak.",
  "[C] This section teaches you how to work with files in C, including creating, reading, writing, manipulating and deleting files.",
  "[C] Unlike other programming languages that have automatic error handling, In C language error handling is to be manually done by the developers using error-handling methods, debugging strategies, and functions like perror(), strerror(), etc.",
  "[C] This section explores various essential of C language that do not fit into a single category but play a vital role in C programming and provide advanced functionality to your program.",
  "[C] This section teaches you high-level C programming techniques such as multi-threading, signal handling, socket programming, etc which are used in creating high-performance robust applications and systems.",
  "[C] Now that you have a strong foundation in C language, you can explore more advanced topics such as Data structures and Algorithms in C. Keep challenging yourself with our collection of practice problems to further strengthen you understanding of the language:",
  "[C] K",
  "[C] K",
  "[C] C Language Introduction",
  "[C] Identifiers in C",
  "[C] Keywords in C",
  "[C] Variables in C",
  "[C] Data Types in C",
  "[C] Operators in C",
  "[C] Decision Making in C (if , if..else, Nested if, if-else-if )",
  "[C] Loops in C",
  "[C] Functions in C",
  "[C] Arrays in C",
  "[C] Strings in C",
  "[C] Pointers in C",
  "[C] Function Pointer in C",
  "[C] Unions in C",
  "[C] Enumeration (or enum) in C",
  "[C] Structure Member Alignment, Padding and Data Packing",
  "[C] Memory Layout of C Programs",
  "[C] Dynamic Memory Allocation in C",
  "[C] What is Memory Leak?  How can we avoid?",
  "[C] File Handling in C",
  "[C] Read/Write Structure From/to a File in C",
  "[C] Error Handling in C",
  "[C] Using goto for Exception Handling in C",
  "[C] Error Handling During File Operations in C",
  "[C] Variadic Functions in C",
  "[C] Signals in C language",
  "[C] Socket Programming in C",
  "[C] _Generics Keyword in C",
  "[C] Multithreading in C",
  "[C++] C++ is a programming language known for its fast speed, low level memory management and is often taught as first programming language.",
  "[C++] This section guides you through the basic concepts of C++ programming. It covers topics that teaches you to write your first program, manage data, perform different operations and control the flow of the program.",
  "[C++] Functions allow users to divide the program into multiple blocks each performing a specific task. This section teaches you how to work with functions to write a modular and reusable code.",
  "[C++] Compound data types are created from the built-in data types. This section guides you through important compound data types such as array, strings, pointer and structures that helps in managing complex real-world data.",
  "[C++] C++ allows the low-level memory manipulation using pointers and dynamic memory allocation/deallocation operators. This section guides you through the basis of dynamic memory management.",
  "[C++] This section covers key concepts of Object-Oriented Programming (OOP) in C++ such as classes, objects, encapsulation, inheritance, polymorphism, and abstraction.",
  "[C++] This section covers Standard Template Library (STL) which is an in-built library that provides a set of commonly used data structures such as vectors, lists, stacks, queues, maps, etc. and algorithms that enhance productivity and performance.",
  "[C++] Exception handling are the techniques to handle runtime errors efficiently. This section covers how to handle exceptions to prevent crashes and improve the reliability of applications.",
  "[C++] File handling allows programs to store and retrieve data from files. This section introduces file handling in C++ using streams. It covers reading from and writing to files using streams.",
  "[C++] This section covers advanced concepts in C++ such as move preprocessor, multithreading, etc. Mastering these topics allows developers to write efficient, high-performance C++ applications.",
  "[C++] Test what you have learnt through this C++ using a series of our Skill Assessment Test.",
  "[C++] Quickly prepare yourself for C++ interviews with the help of our carefully curated list of commonly asked interview questions.",
  "[C++] K",
  "[C++] K",
  "[C++] Introduction to C++",
  "[C++] Data Types in C++",
  "[C++] Variables in C++",
  "[C++] Operators in C++",
  "[C++] Basic Input / Output in C++",
  "[C++] Control flow statements in Programming",
  "[C++] Loops in C++",
  "[C++] Functions in C++",
  "[C++] Arrays in C++",
  "[C++] Pointers and References in C++",
  "[C++] new and delete Operators in C++ For Dynamic Memory",
  "[C++] Templates in C++",
  "[C++] Structures, Unions and Enumerations in C++",
  "[C++] Exception Handling in C++",
  "[C++] File Handling in C++",
  "[C++] Multithreading in C++",
  "[C++] Namespace in C++",
  "[C++] Object Oriented Programming in C++",
  "[C++] Inheritance in C++",
  "[C++] Polymorphism in C++",
  "[C++] Encapsulation in C++",
  "[C++] Abstraction in C++",
  "[C++] Standard Template Library (STL) in C++",
  "[C++] Containers in C++ STL",
  "[C++] Iterators in C++ STL",
  "[C++] C++ STL Algorithm Library",
  "[C++] C++ Interview Questions and Answers",
  "[C++] C++ Programming Examples",
  "[JavaScript] JavaScript is a programming language used to create dynamic content for websites. It is a lightweight, cross-platform, and single-threaded programming language. It's an interpreted language that executes code line by line, providing more flexibility.",
  "[JavaScript] Mostly browsers can run JavaScript directly, so there's no need to install a compiler. However, the built-in browser console isn’t very beginner-friendly. That’s why we’ve added an online editor below to help you get started easily.",
  "[JavaScript] Before we start, We recommend you to edit the code and try to print your own name.",
  "[JavaScript] Let's Explore JavaScript's fundamentals which will help build you a understanding to start with JavaScript",
  "[JavaScript] Functions in JavaScript are reusable blocks of code that perform a specific task. Events are actions that happen in the browser, such as mouse clicks, keyboard input, or page loading.",
  "[JavaScript] Now you have a basic understanding of JavaScript. So start with some beginner level projects to clear your concept and to implement in real world applications.",
  "[JavaScript] JavaScript provides a versatile set of data structures that help in efficient data storage, manipulation, and problem-solving. In this section, we will explore each data structure and algorithm in detail.",
  "[JavaScript] JavaScript's built-in utilities and ES6+ enhancements provide additional data structures, including the following",
  "[JavaScript] To learn data structure and algorithm with JavaScript in detail, you can refer to our DSA with JavaScript Tutorial.",
  "[JavaScript] Object-Oriented Programming (OOP) in JavaScript, a concept that enables the structure of code by modeling real-world entities as objects with properties and behaviors.",
  "[JavaScript] Now you have a good understanding of JavaScript. So let's implement all these in some real world applications.",
  "[JavaScript] It is a lightweight data format for storing and exchanging data widely used to send data between a server and a client.",
  "[JavaScript] Regular expressions plays important role for validation. Validations help ensure that data entered by users meets specific criteria. ",
  "[JavaScript] Exception and Error handling is crucial for ensuring the reliability and stability of JavaScript applications by handling errors effectively",
  "[JavaScript] This section covers all the interesting facts and features which made JavaScript so popular and will easy if you are switching from other programming languages also.",
  "[JavaScript] Now you have covered almost all the important concepts of JavaScript. These projects will improve and revise your JavaScript Knowledge.",
  "[JavaScript] For all lists of Projects follow the article- JavaScript Project Ideas with Source Code",
  "[JavaScript] This section offers a collection of practice Quiz designed to test and support understanding of various concepts in JavaScript. ",
  "[JavaScript] The javaScript Coding Practice Problems page offers exercises for all skill levels, covering basic Numbers, String to advanced structures like Stack, Queue. These problems help build a strong foundation and boost confidence in solving real-world coding challenges.",
  "[JavaScript] This section provides a list of interview questions related to JavaScript.",
  "[JavaScript] For a quick recap of JavaScript read the article - JavaScript Cheat Sheet",
  "[JavaScript] JavaScript libraries and frameworks play a important role in modern web development. They offer built-in functions and methods that enhance web pages, making them more dynamic and interactive. They handle repetitive tasks, allowing developers to focus on core functionality.",
  "[JavaScript] Also, they provide project structure and data flow structure that helps to create fast and more reliable applications.",
  "[JavaScript] Libraries provide pre-built solutions for common tasks. Developers can use these functions instead of writing code from scratch, saving valuable time. Here are a few popular libraries of JavaScript.",
  "[JavaScript] Frameworks, offer a comprehensive structure for building applications. Here are a few popular frameworks of JavaScript.",
  "[JavaScript] JavaScript is a versatile language that powers various applications, from web development to mobile apps, making it an essential tool for modern programming.",
  "[JavaScript] Real-Time Applications: JavaScript powers real-time applications, such as live chats or notifications, using technologies like WebSockets and Socket.io for instant communication between users and servers.",
  "[JavaScript] K",
  "[JavaScript] K",
  "[JavaScript] Introduction to JavaScript",
  "[JavaScript] Variables and Datatypes in JavaScript",
  "[JavaScript] JavaScript Operators",
  "[JavaScript] Control Statements in JavaScript",
  "[JavaScript] JavaScript Arrays",
  "[JavaScript] JavaScript Array Methods",
  "[JavaScript] JavaScript Strings",
  "[JavaScript] JavaScript String Methods",
  "[JavaScript] Functions in JavaScript",
  "[JavaScript] JavaScript Function Expression",
  "[JavaScript] Function Overloading in JavaScript",
  "[JavaScript] Objects in JavaScript",
  "[JavaScript] JavaScript Object Constructors",
  "[JavaScript] Object Oriented Programming in JavaScript",
  "[JavaScript] Classes and Objects in JavaScript",
  "[JavaScript] What Are Access Modifiers In JavaScript ?",
  "[JavaScript] JavaScript Constructor Method",
  "[JavaScript] Asynchronous JavaScript",
  "[JavaScript] JavaScript Callbacks",
  "[JavaScript] JavaScript Promise",
  "[JavaScript] Event Loop in JavaScript",
  "[JavaScript] Async and Await in JavaScript",
  "[JavaScript] Javascript Error and Exceptional Handling",
  "[JavaScript] JavaScript Errors Throw and Try to Catch",
  "[JavaScript] How to create custom errors in JavaScript ?",
  "[JavaScript] JavaScript TypeError - Invalid Array.prototype.sort argument",
  "[JavaScript] HTML DOM (Document Object Model)",
  "[JavaScript] How to select DOM Elements in JavaScript ?",
  "[JavaScript] JavaScript Custom Events",
  "[JavaScript] JavaScript addEventListener() with Examples",
  "[JavaScript] Closure in JavaScript",
  "[JavaScript] JavaScript Hoisting",
  "[JavaScript] Scope of Variables in JavaScript",
  "[JavaScript] JavaScript Higher Order Functions",
  "[JavaScript] Debugging in JavaScript",
  "[Go] Go (or Golang) is a modern programming language developed by Google, designed for building fast and reliable applications, especially in cloud, DevOps, and distributed systems. Nowadays, many big tech companies have also adopted and rely on it, including:",
  "[Go] Here is a simple Go program that prints a string. You can try editing it to print your own name.",
  "[Go] Output:",
  "[Go] Before starting with Go programming, we first need to set up Go on our system and run a simple program to verify the installation:",
  "[Go] Installing Golang on Windows /  Installing Golang on MacOS",
  "[Go] In this section, we’ll cover the core building blocks of Go such as identifiers, variables, data types, operators, and declarations that form the foundation of every Go program.",
  "[Go] This section covers decision-making and looping constructs in Go, essential for controlling program flow.",
  "[Go] In this section, we’ll explore Go functions and methods, including how to define them, pass arguments, return multiple values, use special features like defer, and work with methods for struct types.",
  "[Go] In this section, we’ll explore Go structures, how to define and nest them, and how methods and fields can be promoted or even used as function fields for flexible data handling.",
  "[Go] In this section, we’ll learn how Go handles collections using arrays and slices, covering their creation, manipulation, comparison, and common operations like sorting, trimming, and splitting.",
  "[Go] In this section, we’ll work with strings in Go, learning how to compare, concatenate, trim, split, search, and repeat them, along with common operations like finding indexes and counting characters.",
  "[Go] In this section, we’ll learn about pointers in Go, how they reference memory addresses, and how to use them with functions, arrays, and structures effectively.",
  "[Go] In this section, we’ll learn about interfaces in Go, how they enable polymorphism, the use of multiple and embedded interfaces, and how they help in writing flexible and reusable code.",
  "[Go] In this section, we’ll learn Go’s powerful concurrency model using goroutines and channels, and see how Go handles multitasking efficiently compared to traditional threads.",
  "[Go] K",
  "[Go] K",
  "[Go] Go Programming Language (Introduction)",
  "[Go] How to Install Go on Windows?",
  "[Go] How to Install Golang on MacOS?",
  "[Go] Hello World in Golang",
  "[Go] Identifiers in Go Language",
  "[Go] Go Keywords",
  "[Go] Data Types in Go",
  "[Go] Go Variables",
  "[Go] Constants- Go Language",
  "[Go] Go Operators",
  "[Go] Go Decision Making (if, if-else, Nested-if, if-else-if)",
  "[Go] Loops in Go Language",
  "[Go] Switch Statement in Go",
  "[Go] Functions in Go Language",
  "[Go] Variadic Functions in Go",
  "[Go] Anonymous function in Go Language",
  "[Go] main and init function in Golang",
  "[Go] What is Blank Identifier(underscore) in Golang?",
  "[Go] Defer Keyword in Golang",
  "[Go] Methods in Golang",
  "[Go] Structures in Golang",
  "[Go] Nested Structure in Golang",
  "[Go] Anonymous Structure and Field in Golang",
  "[Go] Arrays in Go",
  "[Go] How to Copy an Array into Another Array in Golang?",
  "[Go] How to pass an Array to a Function in Golang?",
  "[Go] Slices in Golang",
  "[Go] Slice Composite Literal in Go",
  "[Go] How to sort a slice of ints in Golang?",
  "[Go] How to trim a slice of bytes in Golang?",
  "[Go] How to split a slice of bytes in Golang?",
  "[Go] Strings in Golang",
  "[Go] How to Trim a String in Golang?",
  "[Go] How to Split a String in Golang?",
  "[Go] Different ways to compare Strings in Golang",
  "[Go] Pointers in Golang",
  "[Go] Passing Pointers to a Function in Go",
  "[Go] Pointer to a Struct in Golang",
  "[Go] Go Pointer to Pointer (Double Pointer)",
  "[Go] Comparing Pointers in Golang",
  "[Go] Goroutines - Concurrency in Golang",
  "[Go] Select Statement in Go Language",
  "[Go] Multiple Goroutines",
  "[Go] Channel in Golang",
  "[Go] Unidirectional Channel in Golang",
  "[Ruby] Ruby is a popular backend programming language, widely used for building modern applications and services. It makes development faster, easier, and more productive compared to many other languages. ",
  "[Ruby] Ruby gained worldwide recognition through Ruby on Rails, a framework that revolutionized web development by enabling startups and enterprises to build and scale full-stack applications quickly. Beyond web apps, Ruby is also widely used for automation and scripting tasks, where DevOps teams employ it to manage systems and files. ",
  "[Ruby] Nowadays, many big tech companies have also adopted and rely on Ruby, like:",
  "[Ruby] Here is a simple Ruby program that prints a string. You can try editing it to print your own name.",
  "[Ruby] Before starting with Ruby programming, we first need to set up Ruby on our system and run a simple program to verify the installation:",
  "[Ruby] In this section, we’ll cover the core building blocks of Ruby such as identifiers, variables, data types, operators, and declarations that form the foundation of every Ruby program.",
  "[Ruby] This section covers decision-making and looping constructs in Ruby, essential for controlling program flow.",
  "[Ruby] In this section, we’ll explore Ruby methods, including how to define them, pass arguments, return values, handle recursion, and use special features like visibility controls.",
  "[Ruby] In this section, we’ll explore the core principles of object-oriented programming in Ruby, including classes, inheritance, polymorphism, mixins, and encapsulation.",
  "[Ruby] In this section, we’ll learn how Ruby handles unexpected errors, enabling us to write safe and fault-tolerant programs.",
  "[Ruby] In this section, we’ll explore Ruby’s powerful regex features for text matching, searching, and replacing.",
  "[Ruby] In this section, we’ll cover Ruby’s built-in classes that help handle numbers, symbols, structures, and directories.",
  "[Ruby] In this section, we’ll learn how to use modules to organize methods, share functionality, and extend Ruby classes.",
  "[Ruby] In this section, we’ll work with Ruby’s collection types like arrays, strings, and hashes, along with iterators and blocks.",
  "[Ruby] In this section, we’ll learn about Ruby’s multithreading support to handle concurrent tasks efficiently.",
  "[Ruby] In this section, we’ll explore additional Ruby features that make development easier and more expressive.",
  "[Ruby] K",
  "[Ruby] K",
  "[Ruby] Ruby For Beginners",
  "[Ruby] Ruby Programming Language (Introduction)",
  "[Ruby] Comparison of Java with Other Programming Languages",
  "[Ruby] Similarities and Differences between Ruby and C language",
  "[Ruby] Similarities and Differences between Ruby and C++",
  "[Ruby] Environment Setup in Ruby",
  "[Ruby] How to install Ruby on Linux?",
  "[Ruby] How to install Ruby on Windows?",
  "[Ruby] Interesting facts about Ruby Programming Language",
  "[Ruby] Ruby | Keywords",
  "[Ruby] Ruby | Data Types",
  "[Ruby] Ruby Basic Syntax",
  "[Ruby] Hello World in Ruby",
  "[Ruby] Ruby | Types of Variables",
  "[Ruby] Global Variable in Ruby",
  "[Ruby] Comments in Ruby",
  "[Ruby] Ruby | Ranges",
  "[Ruby] Ruby Literals",
  "[Ruby] Ruby Directories",
  "[Ruby] Ruby | Operators",
  "[Ruby] Operator Precedence in Ruby",
  "[Ruby] Operator Overloading in Ruby",
  "[Ruby] Ruby | Pre-define Variables & Constants",
  "[Ruby] Ruby | unless Statement and unless Modifier",
  "[Ruby] Ruby | Decision Making (if, if-else, if-else-if, ternary) | Set - 1",
  "[Ruby] Ruby | Loops (for, while, do..while, until)",
  "[Ruby] Ruby | Case Statement",
  "[Ruby] Ruby | Control Flow Alteration",
  "[Ruby] Ruby Break and Next Statement",
  "[Ruby] Ruby redo and retry Statement",
  "[Ruby] BEGIN and END Blocks In Ruby",
  "[Ruby] File Handling in Ruby",
  "[Ruby] Ruby | Methods",
  "[Ruby] Method Visibility in Ruby",
  "[Ruby] Recursion in Ruby",
  "[Ruby] Ruby Hook Methods",
  "[Ruby] Ruby | Range Class Methods",
  "[Ruby] The Initialize Method in Ruby",
  "[Ruby] Ruby | Method overriding",
  "[Ruby] Ruby Date and Time",
  "[Ruby] Object-Oriented Programming in Ruby | Set 1",
  "[Ruby] Object Oriented Programming in Ruby | Set-2",
  "[Ruby] Ruby | Class & Object",
  "[Ruby] Private Classes in Ruby",
  "[Ruby] Freezing Objects | Ruby",
  "[Ruby] Ruby | Inheritance",
  "[Ruby] Polymorphism in Ruby",
  "[Ruby] Ruby | Constructors",
  "[Ruby] Ruby | Access Control",
  "[Ruby] Ruby | Encapsulation",
  "[Ruby] Ruby Mixins",
  "[Ruby] Instance Variables in Ruby",
  "[Ruby] Data Abstraction in Ruby",
  "[Ruby] Ruby Static Members",
  "[Ruby] Ruby | Exceptions",
  "[Ruby] Ruby | Exception handling",
  "[Ruby] Catch and Throw Exception In Ruby",
  "[Ruby] Raising Exceptions in Ruby",
  "[Ruby] Ruby | Exception Handling in Threads | Set - 1",
  "[Ruby] Ruby | Exception Class and its Methods",
  "[Ruby] Ruby | Regular Expressions",
  "[Ruby] Ruby Search and Replace",
  "[Ruby] Ruby | Float Class",
  "[Ruby] Ruby | Integer Class",
  "[Ruby] Ruby | Symbol Class",
  "[Ruby] Ruby | Struct Class",
  "[Ruby] Ruby | Dir Class and its methods",
  "[Ruby] Ruby | MatchData Class",
  "[Ruby] Ruby | Module",
  "[Ruby] Ruby | Comparable Module",
  "[Ruby] Ruby | Math Module",
  "[Ruby] Include v/s Extend in Ruby",
  "[Ruby] Ruby | Arrays",
  "[Ruby] Ruby | String Basics",
  "[Ruby] Ruby | String Interpolation",
  "[Ruby] Ruby | Hashes Basics",
  "[Ruby] Ruby | Hash Class",
  "[Ruby] Ruby | Blocks",
  "[PHP] ...",
  "[Swift] Swift is a general-purpose, multi-paradigm, object-oriented, functional, imperative, and block-structured language. Swift is the result of the latest research on programming languages and is built using a modern approach to safety, and software design patterns by Apple Inc. for iOS applications, macOS applications, watchOS applications, tvOS applications. ",
  "[Swift] Swift is easy to learn, easy to implement, safe, fast, and expressive. Developing Swift in the open has its exciting aspects as it is now free to be ported across a wide range of platforms, devices, and use cases.",
  "[Swift] The features of Swift are designed to work together to create a powerful language. Additional features of Swift include:  ",
  "[Swift] Memory Management: Automatic reference counting is a system which tracks the number of references to an object in memory. When an object is no longer needed in the future , ARC automatically deallocates the memory used by that object. This helps to prevent memory leaks, which can occur when an object is no longer needed but its memory is not released, and can help to improve the  performance of the program.Swift is managed as a collection of projects, each with its repositories. The current list of projects include: ",
  "[Swift] Example:  ",
  "[Swift] Output:  ",
  "[Swift] Run: Code can be tested on Online IDE for Swift ",
  "[Swift] Note: Import statement is used to import any objective-C framework or library directly into Swift program. var keyword is used for variable and let keyword is used for constant. There is no need for\";\" for termination, in case the programmer uses it compiler won't show an error. ",
  "[Swift] Advantages - ",
  "[Swift] Disadvantages:",
  "[Swift] S",
  "[Swift] S",
  "[Swift] Swift - Hello World Program",
  "[Swift] Swift - Basic Syntax",
  "[Swift] Swift - Keywords",
  "[Swift] Swift - Literals",
  "[Swift] Swift - Constants, Variables & Print function",
  "[Swift] Swift - Operators",
  "[Swift] Swift - Data Types",
  "[Swift] Swift - Integer, Floating-Point Numbers",
  "[Swift] Strings in Swift",
  "[Swift] String Functions and Operators in Swift",
  "[Swift] How to Concatenate Strings in Swift?",
  "[Swift] How to Append a String to Another String in Swift?",
  "[Swift] How to Insert a Character in String at Specific Index in Swift?",
  "[Swift] How to check if a string contains another string in Swift?",
  "[Swift] How to remove a specific character from a string in Swift?",
  "[Swift] Data Type Conversions in Swift",
  "[Swift] Swift - Convert String to Int Swift",
  "[Swift] Swift - Decision Making Statements",
  "[Swift] Swift - If Statement",
  "[Swift] Swift - If-else Statement",
  "[Swift] Swift - If-else-if Statement",
  "[Swift] Swift - Nested if-else Statement",
  "[Swift] Swift - Switch Statement",
  "[Swift] Swift - Loops",
  "[Swift] Swift - While Loop",
  "[Swift] Swift - Repeat While loop",
  "[Swift] Swift - For-in Loop",
  "[Swift] Swift - Control Statements in Loops",
  "[Swift] Swift - Break Statement",
  "[Swift] Swift - Fallthrough Statement",
  "[Swift] Swift - Guard Statement",
  "[Swift] Calling Functions in Swift",
  "[Swift] Swift Function Parameters and Return Values",
  "[Swift] How to Use Variadic Parameters in Swift?",
  "[Swift] Swift - In Out Parameters",
  "[Swift] Swift - Nested Function",
  "[Swift] Swift - Function Overloading",
  "[Swift] Closures in Swift",
  "[Swift] Escaping and Non-Escaping Closures in Swift",
  "[Swift] Higher-Order Functions in Swift",
  "[Swift] Swift - Arrays",
  "[Swift] Swift - Arrays Properties",
  "[Swift] Swift - How to Store Values in Arrays?",
  "[Swift] How to Remove the last element from an Array in Swift?",
  "[Swift] How to Remove the First element from an Array in Swift?",
  "[Swift] How to count the elements of an Array in Swift?",
  "[Swift] How to Reverse an Array in Swift?",
  "[Swift] Swift Array joined() function",
  "[Swift] How to check if the array contains a given element in Swift?",
  "[Swift] Sorting an Array in Swift",
  "[Swift] How to Swap Array items in Swift?",
  "[Swift] How to check if an array is empty in Swift?",
  "[Swift] Swift - Sets",
  "[Swift] Swift - Set Operations",
  "[Swift] How to remove first element from the Set in Swift?",
  "[Swift] How to remove all the elements from the Set in Swift?",
  "[Swift] How to check if the set contains a given element in Swift?",
  "[Swift] How to count the elements of a Set in Swift?",
  "[Swift] Sorting a Set in Swift",
  "[Swift] How to check if a set is empty in Swift?",
  "[Swift] How to shuffle the elements of a set in Swift?",
  "[Swift] Swift - Difference Between Sets and Arrays",
  "[Swift] Swift - Dictionary",
  "[Swift] Swift - Tuples",
  "[Swift] Swift - Iterate Arrays and Dictionaries",
  "[Swift] Swift Structures",
  "[Swift] Swift - Properties and its Different Types",
  "[Swift] Swift - Methods",
  "[Swift] Swift - Difference Between Function and Method",
  "[Swift] Swift - Deinitialization and How its Works?",
  "[Swift] Typecasting in Swift",
  "[Swift] Repeating Timers in Swift",
  "[Swift] Non Repeating Timers in Swift",
  "[Swift] Difference between Repeating and Non-Repeating timers in Swift",
  "[Swift] Optional Chaining in Swift",
  "[Swift] Singleton Class in Swift",
  "[Swift] Swift - Error Handling",
  "[Swift] Difference between Try, Try?, and Try! in Swift",
  "[Swift] Swift - Typealias",
  "[Swift] Important Points to Know About Java and Swift",
  "[Swift] Difference between Swift Structures and C Structure",
  "[Swift] How to Build and Publish SCADE Apps to Apple and Google Stores?",
  "[Swift] 6 Best iOS Project Ideas For Beginners"
]